const patterns = {
  TITLE: /^[\\w\\s\\p{Punct} a-zA-ZáéíóúüÁÉÍÓÚÜñÑ0-9\\-\\+\\?\\*]+$/,
  DESCRIPTION: /^[\\w\\s\\p{Punct} aA-zZáéíóúüÁÉÍÓÚÜñÑ0-9\\-\\+\\?\\*\\/\\.\\,]+$/,
  FIRSTNAME: /^([a-zA-ZñÑáéíóúüÁÉÍÓÚÜ]{2,50})(([ a-zA-ZñÑáéíóúüÁÉÍÓÚÜ]{2,50})){0,1}$/,
  LASTNAME: /^([a-zA-ZñÑáéíóúüÁÉÍÓÚÜ]{2,50})(([ a-zA-ZñÑáéíóúüÁÉÍÓÚÜ]{2,50})){0,1}$/,
  PASSWORD: /^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#&()–{}:;',?/*~$^+=<>]).{8,20}$/,
  EMAIL: /^[a-z0-9._+-]+@[a-z0-9.-]+\.[a-z]{2,}$/,
  PHONE_NUMBER: /^\+(\d{1,3})\((\d{2,5})\)(\d{5,10})$/
}

export {
    patterns
}